package ru.simakov.javacore.lvl1;

/**
 * Разобраться с имеющимся кодом.
 * <p>
 * Добавить класс Team, который будет содержать:
 * <ul>
 * <li> название команды;
 * <li> массив из четырех участников (в конструкторе можно сразу всех участников указывать);
 * <li> метод для вывода информации о членах команды, прошедших дистанцию;
 * <li> метод вывода информации обо всех членах команды.
 * </ul>
 * <p>
 * Добавить класс Course (полоса препятствий), в котором будут находиться:
 * <p>
 * <ul>
 * <li> массив препятствий;
 * <li> метод, который будет просить команду пройти всю полосу.
 * </ul>
 * <p>
 * В итоге должно получиться что-то похожее:
 */
public class App {

    public static void main(String[] args) {
        //Course c = new Course(/*...*/); // Создаем полосу препятствий
        //Team team = new Team(/*...*/); // Создаем команду
        //c.doIt(team); // Просим команду пройти полосу
        //team.showResults(); // Показываем результаты
    }
}
